Model: "c4-ai-vs-smart-50k"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_1 (Dense)              (None, 43)                1892
_________________________________________________________________
dense_2 (Dense)              (None, 64)                2816
_________________________________________________________________
dense_3 (Dense)              (None, 256)               16640
_________________________________________________________________
dense_4 (Dense)              (None, 256)               65792
_________________________________________________________________
dense_5 (Dense)              (None, 42)                10794
_________________________________________________________________
dense_6 (Dense)              (None, 3)                 129
=================================================================
Total params: 98,063
Trainable params: 98,063
Non-trainable params: 0
_________________________________________________________________
Using options: check_early_win, prevent_other_win
Model ready. Press enter to start tests.
Simulating games...: 100%|█████████████████| 1000/1000 [00:41<00:00, 23.96it/s]
Accuracy vs random (x1000)     : 98.20% wins, 0.00% draws, 1.80% losses.
Simulating games...: 100%|█████████████████| 1000/1000 [03:34<00:00,  4.65it/s]
Accuracy vs smart (x1000, n=3) : 88.70% wins, 0.00% draws, 11.30% losses.
Simulating games...: 100%|█████████████████| 1000/1000 [05:38<00:00,  2.96it/s]
Accuracy vs smart (x1000, n=5) : 84.40% wins, 0.00% draws, 15.60% losses.
Simulating games...: 100%|███████████████████| 100/100 [13:52<00:00,  8.33s/it]
Accuracy vs smart (x100, n=100): 15.00% wins, 0.00% draws, 85.00% losses.