Model: "c4-ai-vs-smart-10k"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_1 (Dense)              (None, 43)                1892
_________________________________________________________________
dense_2 (Dense)              (None, 64)                2816
_________________________________________________________________
dense_3 (Dense)              (None, 256)               16640
_________________________________________________________________
dense_4 (Dense)              (None, 256)               65792
_________________________________________________________________
dense_5 (Dense)              (None, 42)                10794
_________________________________________________________________
dense_6 (Dense)              (None, 3)                 129
=================================================================
Total params: 98,063
Trainable params: 98,063
Non-trainable params: 0
_________________________________________________________________
Using options: check_early_win, prevent_other_win
Model ready. Press enter to start tests.
Simulating games...: 100%|█████████████████| 1000/1000 [01:04<00:00, 15.53it/s]
Accuracy vs random (x1000)     : 97.50% wins, 0.10% draws, 2.40% losses.
Simulating games...: 100%|█████████████████| 1000/1000 [03:46<00:00,  4.42it/s]
Accuracy vs smart (x1000, n=3) : 87.50% wins, 0.00% draws, 12.50% losses.
Simulating games...: 100%|█████████████████| 1000/1000 [06:01<00:00,  2.77it/s]
Accuracy vs smart (x1000, n=5) : 76.90% wins, 0.00% draws, 23.10% losses.
Simulating games...: 100%|███████████████████| 100/100 [10:54<00:00,  6.54s/it]
Accuracy vs smart (x100, n=100): 9.00% wins, 0.00% draws, 91.00% losses.