Model: "c4-merge-100k"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_1 (Dense)              (None, 43)                1892
_________________________________________________________________
dense_2 (Dense)              (None, 64)                2816
_________________________________________________________________
dense_3 (Dense)              (None, 256)               16640     
_________________________________________________________________
dense_4 (Dense)              (None, 256)               65792
_________________________________________________________________
dense_5 (Dense)              (None, 42)                10794
_________________________________________________________________
dense_6 (Dense)              (None, 3)                 129
=================================================================
Total params: 98,063
Trainable params: 98,063
Non-trainable params: 0
_________________________________________________________________
Using options: check_early_win, prevent_other_win
Model ready. Press enter to start tests.
Simulating games...: 100%|█████████████████| 1000/1000 [00:54<00:00, 18.30it/s]
Accuracy vs random (x1000)     : 99.70% wins, 0.00% draws, 0.30% losses.
Simulating games...: 100%|█████████████████| 1000/1000 [03:28<00:00,  4.80it/s]
Accuracy vs smart (x1000, n=3) : 97.30% wins, 0.00% draws, 2.70% losses.
Simulating games...: 100%|█████████████████| 1000/1000 [05:28<00:00,  3.05it/s]
Accuracy vs smart (x1000, n=5) : 93.10% wins, 0.00% draws, 6.90% losses.
Simulating games...: 100%|███████████████████| 100/100 [14:11<00:00,  8.51s/it]
Accuracy vs smart (x100, n=100): 22.00% wins, 0.00% draws, 78.00% losses.