Model: "trained_50k"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_1 (Dense)              (None, 43)                1892
_________________________________________________________________
dense_2 (Dense)              (None, 64)                2816
_________________________________________________________________
dense_3 (Dense)              (None, 256)               16640
_________________________________________________________________
dense_4 (Dense)              (None, 256)               65792
_________________________________________________________________
dense_5 (Dense)              (None, 42)                10794
_________________________________________________________________
dense_6 (Dense)              (None, 3)                 129
=================================================================
Total params: 98,063
Trainable params: 98,063
Non-trainable params: 0
_________________________________________________________________
Using options: check_early_win, prevent_other_win
Model ready. Press enter to start tests.
Simulating games...: 100%|█████████████████| 1000/1000 [00:57<00:00, 17.26it/s]
Accuracy vs random (x1000)     : 99.50% wins, 0.00% draws, 0.50% losses.
Simulating games...: 100%|█████████████████| 1000/1000 [03:35<00:00,  4.63it/s]
Accuracy vs smart (x1000, n=3) : 96.50% wins, 0.00% draws, 3.50% losses.
Simulating games...: 100%|█████████████████| 1000/1000 [05:51<00:00,  2.84it/s]
Accuracy vs smart (x1000, n=5) : 90.40% wins, 0.00% draws, 9.60% losses.
Simulating games...: 100%|███████████████████| 100/100 [15:02<00:00,  9.03s/it]
Accuracy vs smart (x100, n=100): 18.00% wins, 0.00% draws, 82.00% losses.