Model: "trained_10k-norm"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_1 (Dense)              (None, 42)                1806
_________________________________________________________________
dense_2 (Dense)              (None, 64)                2752
_________________________________________________________________
dense_3 (Dense)              (None, 256)               16640
_________________________________________________________________
dense_4 (Dense)              (None, 256)               65792
_________________________________________________________________
dense_5 (Dense)              (None, 42)                10794
_________________________________________________________________
dense_6 (Dense)              (None, 3)                 129
=================================================================
Total params: 97,913
Trainable params: 97,913
Non-trainable params: 0
_________________________________________________________________
Using options: check_early_win, prevent_other_win
Model ready. Press enter to start tests.
Simulating games...: 100%|█████████████████| 1000/1000 [01:35<00:00, 10.45it/s]
Accuracy vs random (x1000)     : 93.20% wins, 0.10% draws, 6.70% losses.
Simulating games...: 100%|█████████████████| 1000/1000 [05:19<00:00,  3.13it/s]
Accuracy vs smart (x1000, n=3) : 71.00% wins, 0.00% draws, 29.00% losses.
Simulating games...: 100%|█████████████████| 1000/1000 [07:41<00:00,  2.17it/s]
Accuracy vs smart (x1000, n=5) : 55.00% wins, 0.00% draws, 45.00% losses.
Simulating games...: 100%|███████████████████| 100/100 [11:37<00:00,  6.98s/it]
Accuracy vs smart (x100, n=100): 5.00% wins, 0.00% draws, 95.00% losses.