Model: "trained_10k"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_1 (Dense)              (None, 43)                1892
_________________________________________________________________
dense_2 (Dense)              (None, 64)                2816
_________________________________________________________________
dense_3 (Dense)              (None, 256)               16640
_________________________________________________________________
dense_4 (Dense)              (None, 256)               65792
_________________________________________________________________
dense_5 (Dense)              (None, 42)                10794
_________________________________________________________________
dense_6 (Dense)              (None, 3)                 129
=================================================================
Total params: 98,063
Trainable params: 98,063
Non-trainable params: 0
_________________________________________________________________
Using options: check_early_win, prevent_other_win
Model ready. Press enter to start tests.
Simulating games...: 100%|█████████████████| 1000/1000 [01:12<00:00, 13.87it/s]
Accuracy vs random (x1000)     : 98.30% wins, 0.00% draws, 1.70% losses.
Simulating games...: 100%|█████████████████| 1000/1000 [04:24<00:00,  3.78it/s]
Accuracy vs smart (x1000, n=3) : 88.00% wins, 0.00% draws, 12.00% losses.
Simulating games...: 100%|█████████████████| 1000/1000 [07:01<00:00,  2.37it/s]
Accuracy vs smart (x1000, n=5) : 79.00% wins, 0.00% draws, 21.00% losses.
Simulating games...: 100%|███████████████████| 100/100 [15:44<00:00,  9.44s/it]
Accuracy vs smart (x100, n=100): 13.00% wins, 0.00% draws, 87.00% losses.